src/python/toolchain/payments/stripe_integration/test_utils/fixtures/customer_subscription_deleted_webhook.json

{
    "id": "evt_1LS4epEfbv3GSgSdpeJSfTq0",
    "object": "event",
    "api_version": "2020-08-27",
    "created": 1659383526,
    "data": {
      "object": {
        "id": "sub_1LAzcbEfbv3GSgSdoclumfVG",
        "object": "subscription",
        "application": null,
        "application_fee_percent": null,
        "automatic_tax": {
          "enabled": false
        },
        "billing_cycle_anchor": 1659382341,
        "billing_thresholds": null,
        "cancel_at": null,
        "cancel_at_period_end": false,
        "canceled_at": 1659383526,
        "collection_method": "charge_automatically",
        "created": 1655312593,
        "currency": "usd",
        "current_period_end": 1662060741,
        "current_period_start": 1659382341,
        "customer": "cus_Lsl8iaBe92sEgT",
        "days_until_due": null,
        "default_payment_method": null,
        "default_source": null,
        "default_tax_rates": [
        ],
        "description": null,
        "discount": null,
        "ended_at": 1659383526,
        "items": {
          "object": "list",
          "data": [
            {
              "id": "si_Lsl8REF1hDAR4h",
              "object": "subscription_item",
              "billing_thresholds": null,
              "created": 1655312594,
              "metadata": {
              },
              "plan": {
                "id": "price_1L0b8UEfbv3GSgSdsL0yLmmn",
                "object": "plan",
                "active": true,
                "aggregate_usage": null,
                "amount": 49900,
                "amount_decimal": "49900",
                "billing_scheme": "per_unit",
                "created": 1652835190,
                "currency": "usd",
                "interval": "month",
                "interval_count": 1,
                "livemode": true,
                "metadata": {
                },
                "nickname": null,
                "product": "prod_Li1AYZynbAmASM",
                "tiers_mode": null,
                "transform_usage": null,
                "trial_period_days": null,
                "usage_type": "licensed"
              },
              "price": {
                "id": "price_1L0b8UEfbv3GSgSdsL0yLmmn",
                "object": "price",
                "active": true,
                "billing_scheme": "per_unit",
                "created": 1652835190,
                "currency": "usd",
                "custom_unit_amount": null,
                "livemode": true,
                "lookup_key": null,
                "metadata": {
                },
                "nickname": null,
                "product": "prod_Li1AYZynbAmASM",
                "recurring": {
                  "aggregate_usage": null,
                  "interval": "month",
                  "interval_count": 1,
                  "trial_period_days": null,
                  "usage_type": "licensed"
                },
                "tax_behavior": "unspecified",
                "tiers_mode": null,
                "transform_quantity": null,
                "type": "recurring",
                "unit_amount": 49900,
                "unit_amount_decimal": "49900"
              },
              "quantity": 1,
              "subscription": "sub_1LAzcbEfbv3GSgSdoclumfVG",
              "tax_rates": [
              ]
            }
          ],
          "has_more": false,
          "total_count": 1,
          "url": "/v1/subscription_items?subscription=sub_1LAzcbEfbv3GSgSdoclumfVG"
        },
        "latest_invoice": "in_1LS4ThEfbv3GSgSd4rJZf73x",
        "livemode": true,
        "metadata": {
          "toolchain_id": "Vj7DDekXgVAvt6Zd7ggQWs",
          "toolchain_env": "prod"
        },
        "next_pending_invoice_item_invoice": null,
        "pause_collection": null,
        "payment_settings": {
          "payment_method_options": null,
          "payment_method_types": null,
          "save_default_payment_method": "off"
        },
        "pending_invoice_item_interval": null,
        "pending_setup_intent": "seti_1LAzccEfbv3GSgSdMyudKmn6",
        "pending_update": null,
        "plan": {
          "id": "price_1L0b8UEfbv3GSgSdsL0yLmmn",
          "object": "plan",
          "active": true,
          "aggregate_usage": null,
          "amount": 49900,
          "amount_decimal": "49900",
          "billing_scheme": "per_unit",
          "created": 1652835190,
          "currency": "usd",
          "interval": "month",
          "interval_count": 1,
          "livemode": true,
          "metadata": {
          },
          "nickname": null,
          "product": "prod_Li1AYZynbAmASM",
          "tiers_mode": null,
          "transform_usage": null,
          "trial_period_days": null,
          "usage_type": "licensed"
        },
        "quantity": 1,
        "schedule": null,
        "start_date": 1655312593,
        "status": "canceled",
        "test_clock": null,
        "transfer_data": null,
        "trial_end": 1659382341,
        "trial_start": 1655312593
      }
    },
    "livemode": true,
    "pending_webhooks": 2,
    "request": {
      "id": "req_f7GCA7NYwriOMd",
      "idempotency_key": null
    },
    "type": "customer.subscription.deleted"
  }