src/python/toolchain/payments/stripe_integration/test_utils/fixtures/subscription_updated_webhook.json

{
  "id": "evt_1L8pCiEfbv3GSgSdXZkauxlF",
  "object": "event",
  "api_version": "2020-08-27",
  "created": 1654795891,
  "data": {
    "object": {
      "id": "sub_1L3RW5Efbv3GSgSdi4yoCCQt",
      "object": "subscription",
      "application": null,
      "application_fee_percent": null,
      "automatic_tax": {
        "enabled": false
      },
      "billing_cycle_anchor": 1653772397,
      "billing_thresholds": null,
      "cancel_at": null,
      "cancel_at_period_end": false,
      "canceled_at": null,
      "collection_method": "charge_automatically",
      "created": 1653513197,
      "current_period_end": 1656450797,
      "current_period_start": 1653772397,
      "customer": "cus_LcefuO2Rr0Rdac",
      "days_until_due": null,
      "default_payment_method": null,
      "default_source": null,
      "default_tax_rates": [
      ],
      "description": null,
      "discount": null,
      "ended_at": null,
      "items": {
        "object": "list",
        "data": [
          {
            "id": "si_LkxQ7ta0gdR8Nn",
            "object": "subscription_item",
            "billing_thresholds": null,
            "created": 1653513197,
            "metadata": {
            },
            "plan": {
              "id": "price_1KvR8PEfbv3GSgSdnaXqkFUF",
              "object": "plan",
              "active": true,
              "aggregate_usage": null,
              "amount": 2000,
              "amount_decimal": "2000",
              "billing_scheme": "per_unit",
              "created": 1651605105,
              "currency": "usd",
              "interval": "month",
              "interval_count": 1,
              "livemode": false,
              "metadata": {
              },
              "nickname": null,
              "product": "prod_LcgVoYRbtZeS7i",
              "tiers_mode": null,
              "transform_usage": null,
              "trial_period_days": 20,
              "usage_type": "licensed"
            },
            "price": {
              "id": "price_1KvR8PEfbv3GSgSdnaXqkFUF",
              "object": "price",
              "active": true,
              "billing_scheme": "per_unit",
              "created": 1651605105,
              "currency": "usd",
              "livemode": false,
              "lookup_key": null,
              "metadata": {
              },
              "nickname": null,
              "product": "prod_LcgVoYRbtZeS7i",
              "recurring": {
                "aggregate_usage": null,
                "interval": "month",
                "interval_count": 1,
                "trial_period_days": 20,
                "usage_type": "licensed"
              },
              "tax_behavior": "unspecified",
              "tiers_mode": null,
              "transform_quantity": null,
              "type": "recurring",
              "unit_amount": 2000,
              "unit_amount_decimal": "2000"
            },
            "quantity": 1,
            "subscription": "sub_1L3RW5Efbv3GSgSdi4yoCCQt",
            "tax_rates": [
            ]
          }
        ],
        "has_more": false,
        "total_count": 1,
        "url": "/v1/subscription_items?subscription=sub_1L3RW5Efbv3GSgSdi4yoCCQt"
      },
      "latest_invoice": "in_1L4X2MEfbv3GSgSdxXDSH2QM",
      "livemode": false,
      "metadata": {
        "toolchain_id": "oKQyoXk7cvjkiyEhhG7xca",
        "toolchain_env": "asher"
      },
      "next_pending_invoice_item_invoice": null,
      "pause_collection": null,
      "payment_settings": {
        "payment_method_options": null,
        "payment_method_types": null,
        "save_default_payment_method": "off"
      },
      "pending_invoice_item_interval": null,
      "pending_setup_intent": null,
      "pending_update": null,
      "plan": {
        "id": "price_1KvR8PEfbv3GSgSdnaXqkFUF",
        "object": "plan",
        "active": true,
        "aggregate_usage": null,
        "amount": 2000,
        "amount_decimal": "2000",
        "billing_scheme": "per_unit",
        "created": 1651605105,
        "currency": "usd",
        "interval": "month",
        "interval_count": 1,
        "livemode": false,
        "metadata": {
        },
        "nickname": null,
        "product": "prod_LcgVoYRbtZeS7i",
        "tiers_mode": null,
        "transform_usage": null,
        "trial_period_days": 20,
        "usage_type": "licensed"
      },
      "quantity": 1,
      "schedule": null,
      "start_date": 1653513197,
      "status": "active",
      "test_clock": null,
      "transfer_data": null,
      "trial_end": 1653772397,
      "trial_start": 1653513197
    },
    "previous_attributes": {
      "status": "past_due"
    }
  },
  "livemode": false,
  "pending_webhooks": 1,
  "request": {
    "id": "req_okeldutUx0SFlP",
    "idempotency_key": "506b62b6-39f1-49f6-9160-c44d992ecf15"
  },
  "type": "customer.subscription.updated"
}